In [1]:
import pandas as pd 
import numpy as np

In [4]:
pop = {
    "Nevada":{2001:2.4,2002:2.9},
    "Ohio":{2000:1.5,2001:1.7,2002:3.6}
}

In [7]:
pop = pd.DataFrame(pop)
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [6]:
pop.transpose
pop

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [8]:
frame3 = pd.DataFrame(pop)

In [9]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [13]:
pdata={"ohio":frame3["Ohio"][:-1],
      "Neveda":frame3["Nevada"][:2]
      }

In [14]:
pdata

{'ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64, 'Neveda': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64}

In [15]:
pdata = pd.DataFrame(pdata)

In [16]:
pdata

      ohio  Neveda
2000   1.5     NaN
2001   1.7     2.4

In [17]:
pdata.index.name="year"; pdata.columns.name="state"

In [18]:
pdata

state  ohio  Neveda
year
2000    1.5     NaN
2001    1.7     2.4

# index object

In [20]:
obj= pd.Series(range(3),index=["a","b","c"])

In [21]:
index=obj.index

In [22]:
index[:1]

Index(['a'], dtype='object')

# Reindexing

In [28]:
obj = pd.Series([1.1,1.2,1.3,1.4],index=["A","b","c","d"])

In [29]:
obj2 = obj.reindex(["A","b","c","d","e"])

In [30]:
obj2

A    1.1
b    1.2
c    1.3
d    1.4
e    NaN
dtype: float64

In [32]:
obj3 = obj.reindex(["A","b","c","d","e","f"],method = "ffill")# ffill mean if the next value is NAN then assign it the previous value

In [33]:
obj3

A    1.1
b    1.2
c    1.3
d    1.4
e    1.4
f    1.4
dtype: float64

In [38]:
frame = pd.DataFrame(np.arange(9).reshape (3,3),index=["a","c","d"],columns=["ohio","Nevada","Karachi"])
frame

   ohio  Nevada  Karachi
a     0       1        2
c     3       4        5
d     6       7        8

In [42]:
frame2 = frame.reindex(["a","b","c","d"])
frame2

   ohio  Nevada  Karachi
a   0.0     1.0      2.0
b   NaN     NaN      NaN
c   3.0     4.0      5.0
d   6.0     7.0      8.0

In [45]:
states = ["ohio","Karachi","hyderabad"] # since there was no coloumn of hyderabad in frame2 so it values are NAN
frame2.reindex(columns=states)

   ohio  Karachi  hyderabad
a   0.0      2.0        NaN
b   NaN      NaN        NaN
c   3.0      5.0        NaN
d   6.0      8.0        NaN

In [46]:
frame2.loc[["a","b","c","d"],states]

/Users/anas/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

   ohio  Karachi  hyderabad
a   0.0      2.0        NaN
b   NaN      NaN        NaN
c   3.0      5.0        NaN
d   6.0      8.0        NaN

In [50]:
frame2.reindex(["a","b","c","d"],method="bfill") #######

   ohio  Nevada  Karachi
a   0.0     1.0      2.0
b   NaN     NaN      NaN
c   3.0     4.0      5.0
d   6.0     7.0      8.0

In [54]:
frame2.drop(index="b")

   ohio  Nevada  Karachi
a   0.0     1.0      2.0
c   3.0     4.0      5.0
d   6.0     7.0      8.0

In [59]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
index = ['karachi','lahore','islamabad','quetta'],
columns= ['one','two','three','four'])

In [60]:
data

           one  two  three  four
karachi      0    1      2     3
lahore       4    5      6     7
islamabad    8    9     10    11
quetta      12   13     14    15

In [61]:
data.drop("karachi",axis=0) # axis=0 is row

           one  two  three  four
lahore       4    5      6     7
islamabad    8    9     10    11
quetta      12   13     14    15

In [62]:
data.drop("one",axis=1)# axis =1 is coloumn

           two  three  four
karachi      1      2     3
lahore       5      6     7
islamabad    9     10    11
quetta      13     14    15

# Indexing, Selection and Filtering

In [63]:
obj = pd.Series(np.arange(4),index=["a","b","c","d"])

In [64]:
obj["b"]

1

In [65]:
obj["b":"d"] # silicing by custom index

b    1
c    2
d    3
dtype: int64

In [66]:
obj[2:4] # silicing by default index

c    2
d    3
dtype: int64

In [67]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
index = ['karachi','lahore','islamabad','quetta'],
columns= ['one','two','three','four'])

In [69]:
data[data["three"]>5] = 10

In [70]:
data

           one  two  three  four
karachi      0    1      2     3
lahore      10   10     10    10
islamabad   10   10     10    10
quetta      10   10     10    10

In [71]:
#.loc(row,col)
data.loc["karachi",["one","two","three"]]

one      0
two      1
three    2
Name: karachi, dtype: int64

In [73]:
data.iloc[[1,2],[3,0,1]]

           four  one  two
lahore       10   10   10
islamabad    10   10   10

In [74]:
data.iloc[:,:3][data["three"]>5]

           one  two  three
lahore      10   10     10
islamabad   10   10     10
quetta      10   10     10

In [77]:
df1 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list("abc"), index= ['lahore','islamabad','quetta'])

In [78]:
df2= pd.DataFrame(np.arange(12).reshape(4,3),columns=list("bcd"), index= ['ab','islamabad','quetta',"karachi"])

In [79]:
df = df1 + df2

In [80]:
df

            a     b     c   d
ab        NaN   NaN   NaN NaN
islamabad NaN   7.0   9.0 NaN
karachi   NaN   NaN   NaN NaN
lahore    NaN   NaN   NaN NaN
quetta    NaN  13.0  15.0 NaN

In [85]:
df1 = pd.DataFrame({"A":[1,2]})
df2 = pd.DataFrame({"B":[3,4,4]})

In [86]:
df1+df2 # no col in df1 named B and no col in df2 named A

    A   B
0 NaN NaN
1 NaN NaN
2 NaN NaN

In [87]:
# those val that can`t be found becomes nan

In [90]:
df2.add(df1,fill_value=1)

     A    B
0  2.0  4.0
1  3.0  5.0
2  NaN  5.0

In [91]:
arr = np.arange(16).reshape(4,4)
arr1=arr[0]

In [93]:
arr -arr1 # broadcasting

array([[ 0,  0,  0,  0],
       [ 4,  4,  4,  4],
       [ 8,  8,  8,  8],
       [12, 12, 12, 12]])

In [94]:
# if order are different and you perform operation the result will be given after computer apply broadcast to nake the order same

# Function Application and mapping

In [96]:
f=lambda x:x*100
f(2)

200